package templateSeg;

/**
 * 词的标注类型
 * @author luogang
 *
 */
public enum PartOfSpeech {
	start,//开始
	end,//结束
	a,//形容词
	ad,//副形词
	ag,//形语素
	an,//名形词
	b,//区别词
	c,//连词
	d,//副词
	dg,//副语素
	e,//叹词
	f,//方位词 
	g,//语素  
	h,//前接成分  
	i,//成语 
	j,//简称略语  
	k,//后接成分
	l,//习用语  
	m,//数词  
	n,//名词 
	ng,//名语素  
	nr,//人名 
	ns,//地名 
	nt,//机构团体 
	nx,//字母专名
	nz,//其他专名  
	o,//拟声词  
	p,//介词 
	q,//量词 
	r,//代词  
	s,//处所词  
	t,//时间词  
	tg,//时语素  
	u,//助词  
	ud,//结构助词
	ug,//时态助词
	uj,//结构助词的
	ul,//时态助词了
	uv,//结构助词地
	uz,//时态助词着
	v,//动词 
	vd,//副动词 
	vg,//动语素  
	vn,//名动词  
	w,//标点符号
	x,//非语素字  
	y,//语气词  
	z,//状态词
	unknow //未知
}
